// Все стірлочними!!!!!!!!!
//     - створити функцію яка приймає масив чисел та повертає середнє арифметичне його значень.

// let sum = (a,b,c) => (a+b+c)/3;
// console.log(sum(3,9,5));

// - створити функцію яка приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
// (Math використовувати заборонено);

let numbers = [7,2,89,6,17];

const foo = arr => {
    let min = arr[0];
    for (const minEl of arr){
        if (minEl > min){
            min = minEl
        }

    }
    return min;
};
console.log(foo(numbers));

// - створити функцію яка заповнює масив рандомними числами
// (цей код генерує рандомні числа в діапазоні від 0 до 100 - Math.round(Math.random()*100)) та виводить його.



// - створити функцію яка заповнює масив рандомними числами в діапазоні від 0 до limit. limit - аргумент,
// який характеризує кінцеве значення діапазону.




// - Функція приймає масив та робить з нього новий масив в зворотньому порядку. [1,2,3] -> [3, 2, 1].



//     Переробити на стрілочні функції з попереднього дз
// - створити функцію яка обчислює та повертає площу прямокутника зі сторонами а і б


// let s = (a,b)=>a*b;
// console.log(s(20,30));


// - створити функцію яка обчислює та повертає площу кола з радіусом r

// let s = (p,r)=>p*r*2;
// console.log(s(3.14,8));



// - створити функцію яка обчислює та повертає площу циліндру висотою h, та радіутом r




// let s = (p,r,h)=> 2*p*r*h;
// console.log(s(3.14, 10, 3));


// - створити функцію яка приймає масив та виводить кожен його елемент


// let di = (...a) => {
//     for ( const item of a) {
//             console.log(item);
//     }
// }
// console.log(di([1, 6, 4, 8]));

// - створити функцію яка створює параграф з текстом. Текст задати через аргумент

// const foo = text => {
//     document.write(`<p>${text}</p>`);
// };
// foo('figura');

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий

// const foo = text => {
//     document.write(`<li>${text}</li><li>${text}</li><li>${text}</li>`)
// };
// foo('Text');

// - створити функцію яка створює ul з трьома елементами li. Текст li задати через аргумент всім однаковий.
// Кількість li визначається другим аргументом, який є числовим (тут використовувати цикл)

// const dayMneUliLi = (tnt, number) => {
//
//     document.write(`<ul>`)
//         for ( let i = 0; i<number; i++) {
//             document.write(`<li>${tnt}</li>`)
//         }
//     document.write(`</ul>`)
// };
// dayMneUliLi('dead',7)



// - створити функцію яка приймає масив примітивних елементів (числа,стрінги,булеві), та будує для них список

// const gigi = foo => {
//     document.write(`<ol>`)
//     for(const item of foo){
//         document.write(`<li>${item}</li>`)
//     }
//     document.write(`</ol>`)
// };
// gigi([23,true,'tea'])


// - створити функцію яка приймає масив об'єктів з наступними полями id,name,age , та виводить їх в документ.
// Для кожного об'єкту окремий блок.

// let users = [
//     {
//         id: 1,
//         name:'Vova',
//         age: 45
//     },
//     {
//         id: 2,
//         name:'Max',
//         age: 18
//     },
//     {
//         id: 3,
//         name:'Yura',
//         age: 33
//     },
//     {
//         id: 4,
//         name:'Sebas',
//         age: 29
//     },
// ]
// let foo = arr => {
//     for (const arrEl in arr) {
//         document.write(`<div>${arrEl.id}--${arrEl.name}--${arrEl.age}</div>`);
//     }
// }
// foo(users);

// - створити функцію яка повертає найменьше число з масиву


// let numbers = [7,2,89];
// // function foo(arr) {
// const foo = arr => {
//     let min = arr[0];
//     for (const minEl of arr){
//         if (minEl < min){
//             min = minEl;
//         }
//     }
//     return min;
// };
// console.log(foo(numbers));

// - створити функцію яка приймає масив чисел, сумує значення елементів масиву та повертає його. Приклад [1,2,10]->13


// let numbers = [1,2,10];
// const foo = arr => {
//     let summa = 0;
//     for (const items of arr) {
//         summa += items;
//     }
//     return summa;
// };
// console.log(foo(numbers));

// -створити функцію, яка приймає масив з 2х об'єктів, та міняє їх місцями.